qmk/qmk_firmware/tmk_core/protocol/arm_atsam/usb/udi_hid_kbd.c
/**
 * \file
 *
 * \brief USB Device Human Interface Device (HID) keyboard interface.
 *
 * Copyright (c) 2009-2015 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="http://www.atmel.com/design-support/">Atmel Support</a>
 */

#include "samd51j18a.h"
#include "d51_util.h"
#include "conf_usb.h"
#include "usb_protocol.h"
#include "udd.h"
#include "udc.h"
#include "udi_device_conf.h"
#include "udi_hid.h"
#include "udi_hid_kbd.h"
#include <string.h>

//***************************************************************************
// KBD
//***************************************************************************
#ifdef KBD

bool udi_hid_kbd_enable(void);
void udi_hid_kbd_disable(void);
bool udi_hid_kbd_setup(void);
uint8_t udi_hid_kbd_getsetting(void);

UDC_DESC_STORAGE udi_api_t udi_api_hid_kbd = {
    .enable = (bool(*)(void))udi_hid_kbd_enable,
    .disable = (void (*)(void))udi_hid_kbd_disable,
    .setup = (bool(*)(void))udi_hid_kbd_setup,
    .getsetting = (uint8_t(*)(void))udi_hid_kbd_getsetting,
    .sof_notify = NULL,
};

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_kbd_rate;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_kbd_protocol;

COMPILER_WORD_ALIGNED
uint8_t udi_hid_kbd_report_set;

bool udi_hid_kbd_b_report_valid;

COMPILER_WORD_ALIGNED
uint8_t udi_hid_kbd_report[UDI_HID_KBD_REPORT_SIZE];

volatile bool udi_hid_kbd_b_report_trans_ongoing;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_kbd_report_trans[UDI_HID_KBD_REPORT_SIZE];

COMPILER_WORD_ALIGNED
UDC_DESC_STORAGE udi_hid_kbd_report_desc_t udi_hid_kbd_report_desc = {
    {
        0x05, 0x01,     // Usage Page (Generic Desktop)
        0x09, 0x06,     // Usage (Keyboard)
        0xA1, 0x01,     // Collection (Application)
        0x05, 0x07,     //   Usage Page (Keyboard)
        0x19, 0xE0,     //   Usage Minimum (224)
        0x29, 0xE7,     //   Usage Maximum (231)
        0x15, 0x00,     //   Logical Minimum (0)
        0x25, 0x01,     //   Logical Maximum (1)
        0x75, 0x01,     //   Report Size (1)
        0x95, 0x08,     //   Report Count (8)
        0x81, 0x02,     //   Input (Data, Variable, Absolute)
        0x81, 0x01,     //   Input (Constant)
        0x19, 0x00,     //   Usage Minimum (0)
        0x29, 0x65,     //   Usage Maximum (101)
        0x15, 0x00,     //   Logical Minimum (0)
        0x25, 0x65,     //   Logical Maximum (101)
        0x75, 0x08,     //   Report Size (8)
        0x95, 0x06,     //   Report Count (6)
        0x81, 0x00,     //   Input (Data, Array)
        0x05, 0x08,     //   Usage Page (LED)
        0x19, 0x01,     //   Usage Minimum (1)
        0x29, 0x05,     //   Usage Maximum (5)
        0x15, 0x00,     //   Logical Minimum (0)
        0x25, 0x01,     //   Logical Maximum (1)
        0x75, 0x01,     //   Report Size (1)
        0x95, 0x05,     //   Report Count (5)
        0x91, 0x02,     //   Output (Data, Variable, Absolute)
        0x95, 0x03,     //   Report Count (3)
        0x91, 0x01,     //   Output (Constant)
        0xC0            // End Collection
    }
};

static bool udi_hid_kbd_setreport(void);

static void udi_hid_kbd_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep);

static void udi_hid_kbd_setreport_valid(void);

bool udi_hid_kbd_enable(void)
{
    // Initialize internal values
    udi_hid_kbd_rate = 0;
    udi_hid_kbd_protocol = 0;
    udi_hid_kbd_b_report_trans_ongoing = false;
    memset(udi_hid_kbd_report, 0, UDI_HID_KBD_REPORT_SIZE);
    udi_hid_kbd_b_report_valid = false;
    return UDI_HID_KBD_ENABLE_EXT();
}

void udi_hid_kbd_disable(void)
{
    UDI_HID_KBD_DISABLE_EXT();
}

bool udi_hid_kbd_setup(void)
{
    return udi_hid_setup(&udi_hid_kbd_rate,
                            &udi_hid_kbd_protocol,
                            (uint8_t *) &udi_hid_kbd_report_desc,
                            udi_hid_kbd_setreport);
}

uint8_t udi_hid_kbd_getsetting(void)
{
    return 0;
}

static bool udi_hid_kbd_setreport(void)
{
    if ((USB_HID_REPORT_TYPE_OUTPUT == (udd_g_ctrlreq.req.wValue >> 8))
            && (0 == (0xFF & udd_g_ctrlreq.req.wValue))
            && (1 == udd_g_ctrlreq.req.wLength)) {
        // Report OUT type on report ID 0 from USB Host
        udd_g_ctrlreq.payload = &udi_hid_kbd_report_set;
        udd_g_ctrlreq.callback = udi_hid_kbd_setreport_valid;
        udd_g_ctrlreq.payload_size = 1;
        return true;
    }
    return false;
}

bool udi_hid_kbd_send_report(void)
{
    if (!main_b_kbd_enable) {
        return false;
    }

