qmk/qmk_firmware/tmk_core/protocol/arm_atsam/usb/udi_hid_kbd.c
        0x05, 0x0C,         //     Usage Page (Consumer),
        0x0A, 0x38, 0x02,   //     Usage (AC Pan (Horizontal wheel)),
        0x15, 0x81,         //     Logical Minimum (-127),
        0x25, 0x7F,         //     Logical Maximum (127),
        0x95, 0x01,         //     Report Count (1),
        0x75, 0x08,         //     Report Size (8),
        0x81, 0x06,         //     Input (Data, Variable, Relative),

        0xC0,               //   End Collection,
        0xC0,               // End Collection
    }
};

static void udi_hid_mou_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep);

bool udi_hid_mou_enable(void)
{
    // Initialize internal values
    udi_hid_mou_rate = 0;
    udi_hid_mou_protocol = 0;
    udi_hid_mou_b_report_trans_ongoing = false;
    memset(udi_hid_mou_report, 0, UDI_HID_MOU_REPORT_SIZE);
    udi_hid_mou_b_report_valid = false;
    return UDI_HID_MOU_ENABLE_EXT();
}

void udi_hid_mou_disable(void)
{
    UDI_HID_MOU_DISABLE_EXT();
}

bool udi_hid_mou_setup(void)
{
    return udi_hid_setup(&udi_hid_mou_rate,
                            &udi_hid_mou_protocol,
                            (uint8_t *) &udi_hid_mou_report_desc,
                            NULL);
}

uint8_t udi_hid_mou_getsetting(void)
{
    return 0;
}

bool udi_hid_mou_send_report(void)
{
    if (!main_b_mou_enable) {
        return false;
    }

    if (udi_hid_mou_b_report_trans_ongoing) {
        return false;
    }

    memcpy(udi_hid_mou_report_trans, udi_hid_mou_report, UDI_HID_MOU_REPORT_SIZE);
    udi_hid_mou_b_report_valid = false;
    udi_hid_mou_b_report_trans_ongoing =
            udd_ep_run(UDI_HID_MOU_EP_IN | USB_EP_DIR_IN,
                        false,
                        udi_hid_mou_report_trans,
                        UDI_HID_MOU_REPORT_SIZE,
                        udi_hid_mou_report_sent);

    return udi_hid_mou_b_report_trans_ongoing;
}

static void udi_hid_mou_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep)
{
    UNUSED(status);
    UNUSED(nb_sent);
    UNUSED(ep);
    udi_hid_mou_b_report_trans_ongoing = false;
    if (udi_hid_mou_b_report_valid) {
        udi_hid_mou_send_report();
    }
}

#endif //MOU

//********************************************************************************************
// RAW
//********************************************************************************************
#ifdef RAW

bool udi_hid_raw_enable(void);
void udi_hid_raw_disable(void);
bool udi_hid_raw_setup(void);
uint8_t udi_hid_raw_getsetting(void);

UDC_DESC_STORAGE udi_api_t udi_api_hid_raw = {
    .enable = (bool(*)(void))udi_hid_raw_enable,
    .disable = (void (*)(void))udi_hid_raw_disable,
    .setup = (bool(*)(void))udi_hid_raw_setup,
    .getsetting = (uint8_t(*)(void))udi_hid_raw_getsetting,
    .sof_notify = NULL,
};

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_raw_rate;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_raw_protocol;

COMPILER_WORD_ALIGNED
uint8_t udi_hid_raw_report_set[UDI_HID_RAW_REPORT_SIZE];

static bool udi_hid_raw_b_report_valid;

COMPILER_WORD_ALIGNED
uint8_t udi_hid_raw_report[UDI_HID_RAW_REPORT_SIZE];

static bool udi_hid_raw_b_report_trans_ongoing;

COMPILER_WORD_ALIGNED
static uint8_t udi_hid_raw_report_trans[UDI_HID_RAW_REPORT_SIZE];

COMPILER_WORD_ALIGNED
UDC_DESC_STORAGE udi_hid_raw_report_desc_t udi_hid_raw_report_desc = {
    {
        0x06,         // Usage Page (Vendor Defined)
        0xFF, 0xFF,
        0x0A,         // Usage (Mouse)
        0xFF, 0xFF,
        0xA1, 0x01,   // Collection (Application)
        0x75, 0x08,   //   Report Size (8)
        0x15, 0x00,   //   Logical Minimum (0)
        0x25, 0xFF,   //   Logical Maximum (255)
        0x95, 0x40,   //     Report Count
        0x09, 0x01,   //     Usage (Input)
        0x81, 0x02,   //     Input (Data
        0x95, 0x40,   //     Report Count
        0x09, 0x02,   //     Usage (Output)
        0x91, 0x02,   //     Output (Data
        0xC0,         // End Collection - Consumer Control
    }
};

static bool udi_hid_raw_setreport(void);
static void udi_hid_raw_setreport_valid(void);

static void udi_hid_raw_report_sent(udd_ep_status_t status, iram_size_t nb_sent, udd_ep_id_t ep);

bool udi_hid_raw_enable(void)
{
    // Initialize internal values
    udi_hid_raw_rate = 0;
    udi_hid_raw_protocol = 0;
    udi_hid_raw_b_report_trans_ongoing = false;
    memset(udi_hid_raw_report, 0, UDI_HID_RAW_REPORT_SIZE);
    udi_hid_raw_b_report_valid = false;
    return UDI_HID_RAW_ENABLE_EXT();
}

void udi_hid_raw_disable(void)
{
    UDI_HID_RAW_DISABLE_EXT();
}

bool udi_hid_raw_setup(void)
{
    return udi_hid_setup(&udi_hid_raw_rate,
                            &udi_hid_raw_protocol,
                            (uint8_t *) &udi_hid_raw_report_desc,
                            udi_hid_raw_setreport);
}

uint8_t udi_hid_raw_getsetting(void)
{
    return 0;
}

static bool udi_hid_raw_setreport(void)
{
    if ((USB_HID_REPORT_TYPE_OUTPUT == (udd_g_ctrlreq.req.wValue >> 8))
            && (0 == (0xFF & udd_g_ctrlreq.req.wValue))
            && (UDI_HID_RAW_REPORT_SIZE == udd_g_ctrlreq.req.wLength)) {
        // Report OUT type on report ID 0 from USB Host
        udd_g_ctrlreq.payload = udi_hid_raw_report_set;
        udd_g_ctrlreq.callback = udi_hid_raw_setreport_valid; //must call routine to transform setreport to LED state
        udd_g_ctrlreq.payload_size = UDI_HID_RAW_REPORT_SIZE;
        return true;
    }
    return false;
}

bool udi_hid_raw_send_report(void)
{
    if (!main_b_raw_enable) {
        return false;
    }

    if (udi_hid_raw_b_report_trans_ongoing) {
        return false;
    }

    memcpy(udi_hid_raw_report_trans, udi_hid_raw_report,UDI_HID_RAW_REPORT_SIZE);
    udi_hid_raw_b_report_valid = false;
    udi_hid_raw_b_report_trans_ongoing =
            udd_ep_run(UDI_HID_RAW_EP_IN | USB_EP_DIR_IN,
                        false,
                        udi_hid_raw_report_trans,
                        UDI_HID_RAW_REPORT_SIZE,
                        udi_hid_raw_report_sent);

    return udi_hid_raw_b_report_trans_ongoing;
}

